MPPICInterDyMFoam-Tutorial-2/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


(
(0.025 0.01 0.05)
(0.0251 0.01 0.05)
(0.0252 0.01 0.05)
(0.0253 0.01 0.05)
(0.0254 0.01 0.05)
(0.0255 0.01 0.05)
(0.0256 0.01 0.05)
(0.0257 0.01 0.05)
(0.0258 0.01 0.05)
(0.0259 0.01 0.05)
(0.0249 0.01 0.05)
(0.0248 0.01 0.05)
(0.0247 0.01 0.05)
(0.0246 0.01 0.05)
(0.0245 0.01 0.05)
(0.0244 0.01 0.05)
(0.0243 0.01 0.05)
(0.0242 0.01 0.05)
(0.0241 0.01 0.05)
(0.0240 0.01 0.05)
(0.025 0.01 0.049)
(0.0251 0.01 0.049)
(0.0252 0.01 0.049)
(0.0253 0.01 0.049)
(0.0254 0.01 0.049)
(0.0255 0.01 0.049)
(0.0256 0.01 0.049)
(0.0257 0.01 0.049)
(0.0258 0.01 0.049)
(0.0259 0.01 0.049)
(0.0249 0.01 0.049)
(0.0248 0.01 0.049)
(0.0247 0.01 0.049)
(0.0246 0.01 0.049)
(0.0245 0.01 0.049)
(0.0244 0.01 0.049)
(0.0243 0.01 0.049)
(0.0242 0.01 0.049)
(0.0241 0.01 0.049)
(0.0240 0.01 0.049)
(0.0250 0.01 0.048)
(0.0251 0.01 0.048)
(0.0252 0.01 0.048)
(0.0253 0.01 0.048)
(0.0254 0.01 0.048)
(0.0255 0.01 0.048)
(0.0256 0.01 0.048)
(0.0257 0.01 0.048)
(0.0258 0.01 0.048)
(0.0259 0.01 0.048)
(0.0249 0.01 0.048)
(0.0248 0.01 0.048)
(0.0247 0.01 0.048)
(0.0246 0.01 0.048)
(0.0245 0.01 0.048)
(0.0244 0.01 0.048)
(0.0243 0.01 0.048)
(0.0242 0.01 0.048)
(0.0241 0.01 0.048)
(0.0240 0.01 0.048)
(0.0250 0.01 0.047)
(0.0251 0.01 0.047)
(0.0252 0.01 0.047)
(0.0253 0.01 0.047)
(0.0254 0.01 0.047)
(0.0255 0.01 0.047)
(0.0256 0.01 0.047)
(0.0257 0.01 0.047)
(0.0258 0.01 0.047)
(0.0259 0.01 0.047)
(0.0249 0.01 0.047)
(0.0248 0.01 0.047)
(0.0247 0.01 0.047)
(0.0246 0.01 0.047)
(0.0245 0.01 0.047)
(0.0244 0.01 0.047)
(0.0243 0.01 0.047)
(0.0242 0.01 0.047)
(0.0241 0.01 0.047)
(0.0240 0.01 0.047)
(0.0250 0.01 0.046)
(0.0251 0.01 0.046)
(0.0252 0.01 0.046)
(0.0253 0.01 0.046)
(0.0254 0.01 0.046)
(0.0255 0.01 0.046)
(0.0256 0.01 0.046)
(0.0257 0.01 0.046)
(0.0258 0.01 0.046)
(0.0259 0.01 0.046)
(0.0249 0.01 0.046)
(0.0248 0.01 0.046)
(0.0247 0.01 0.046)
(0.0246 0.01 0.046)
(0.0245 0.01 0.046)
(0.0244 0.01 0.046)
(0.0243 0.01 0.046)
(0.0242 0.01 0.046)
(0.0241 0.01 0.046)
(0.0240 0.01 0.046)
)

// ************************************************************************* //
