MPPICInterDyMFoam-Tutorial-2/system/MeshFiles-OF2.3.1/Allclean
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial clean functions
. $WM_PROJECT_DIR/bin/tools/CleanFunctions

rm -rf 0 > /dev/null 2>&1

cleanCase
