MPPICInterDyMFoam-Tutorial-2/system/MeshFiles-OF2.3.1/createBafflesDict.AMI
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    AMI
    {
        type        faceZone;
        zoneName    AMI;

        patchPairs
        {
            type            cyclicAMI;
            transform       noOrdering;
        }
    }
}


// ************************************************************************* //
