MPPICInterDyMFoam-Tutorial-2/system/MeshFiles-OF2.3.1/createBafflesDict.rotorStator
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly true;

// Optionally do not read/convert/write any fields.
//noFields true;


// Baffles to create.
baffles
{
    statorBlades
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    statorBlades;


        //- Optional flip
        //flip        false;

        patchPairs
        {
            type            wall;
            inGroups        (stator);
        }
    }


    rotorBlades
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    rotorBlades;


        //- Optional flip
        //flip        false;

        patchPairs
        {
            type            wall;
            inGroups        (rotor);
        }
    }


}
}


// ************************************************************************* //
